{
    "command": "socube",
    "version": "SoCube v%s, copyright (c) 2022 Zhejiang University. Code contributor is Zhang.H.N",
    "basic_args": {
        "title": "basic configuration",
        "version": "Print socube version information",
        "input": "UMI expression matrix for scRNA-seq, supporting h5 format (pandas DataFrame) and h5ad format (implemented in python package anndata). The rows of the data are cells and the columns are genes, please make sure that the cell ID is unique.",
        "output": "The output directory of the processed intermediate files and the final result, if not specified, the default is the same directory as the input file, if the output directory does not exist, a new one will be created, if it already exists, ontinue to use the existing directory. There are subdirectories embedding for socube embedding features, models, plots and outputs for models, graphs and results generated by model training. The final results are in the outputs subdirectory.",
        "gpu_ids": "Ids of GPUs for accelerated computing, such as \"0,1,2,3\"",
        "seed": "Random seed to reproduce, default is not specific.",
        "k": "The k-fold cross-validation is used in training, and the resulting k models will be ensembled into one model. Default 5.",
        "adj_factor": "The adjustment factor for the doublet expression level. By default it is assumed that the doublet expression level is twice the sinlget, but there are fluctuations in the real situation and the expression level can be changed by adjusting this factor. Default 1.0.",
        "dim": "The target dimension for gene degradation is also the number of channels to train the model. Default 10.",
        "cube_id": "If you want to reuse the socube embedding features obtained earlier,  just specify the embedding ID, which is a string like \"yyyymmdd-HHMMSS-xxx\", along with the original output path.",
        "only_embedding": "This option is provided for users who only want to use socube embedding but do not require doublet detection"
    },
    "model_args": {
        "title": "model training configuration",
        "learning_rate": "Learning rate of model training. Default 1e-3.",
        "epochs": "Epochs of model training. Default 100",
        "train_batch_size": "Batch size of model training. Default 64.",
        "valid_batch_size": "Batch size of model validating. Default 512.",
        "infer_batch_size": "Batch size of model inferring. Default 400.",
        "threshold": "The classification threshold for doublet detection. The model outputs the probability score of doublet, which is greater than the threshold considered as doublet and vice versa for singlet. user can customize the threshold value. Default 0.5.",
        "enable_validation": "This optional is provided for performance evaluation. You should input h5ad format data, and store label in its `obs` property. `obs` property is a `DataFrame` object and its label column named \"type\" and value is \"doublet\" and \"singlet\".",
        "enable_multiprocess": "Enable multi process to make use of CPU's multiple cores."
    },
    "notice_args": {
        "title": "notice configuration",
        "mail": "Email address to send and receive the notification.",
        "mail_server": "Email SMTP server address. such as smtp.gmail.com",
        "mail_port": "Email server SMTP port, such as 994 for SSL.",
        "mail_passwd": "Email account password",
        "enable_ssl": "Enable SSL for mail service"
    }
}