
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>参数详解 · SoCube user manual</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tabs2/tabs.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-image-captions-extended/image-captions.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-plus/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="styles/website.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="term.html" />
    
    
    <link rel="prev" href="5-problem-solution.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="2-requirement.html">
            
                <a href="2-requirement.html">
            
                    
                    环境依赖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="3-install.html">
            
                <a href="3-install.html">
            
                    
                    软件安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="4-usage.html">
            
                <a href="4-usage.html">
            
                    
                    软件使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="5-problem-solution.html">
            
                <a href="5-problem-solution.html">
            
                    
                    问题解决
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="6-parameters.html">
            
                <a href="6-parameters.html">
            
                    
                    参数详解
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="term.html">
            
                <a href="term.html">
            
                    
                    术语
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="reference.html">
            
                <a href="reference.html">
            
                    
                    参考资料
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >参数详解</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div class="search-plus" id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x53C2;&#x6570;&#x8BE6;&#x89E3;">&#x53C2;&#x6570;&#x8BE6;&#x89E3;</h1>
<p>SoCube&#x7684;&#x6240;&#x6709;&#x8F6F;&#x4EF6;&#x53C2;&#x6570;&#x5E2E;&#x52A9;&#x53EF;&#x4EE5;&#x5728;&#x7EC8;&#x7AEF;&#x6267;&#x884C;<code>socube --help</code>&#x5F97;&#x5230;&#xFF0C;&#x8FD9;&#x91CC;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x8BE6;&#x89E3;&#x3002;socube&#x7684;help&#x6587;&#x6863;&#x8F93;&#x51FA;&#x4F1A;&#x6839;&#x636E;&#x7528;&#x6237;&#x7CFB;&#x7EDF;&#x7684;&#x8BED;&#x8A00;&#x4E0E;&#x533A;&#x57DF;&#x8BBE;&#x7F6E;&#x81EA;&#x52A8;&#x9009;&#x62E9;&#x4E2D;&#x6587;&#x6216;&#x8005;&#x82F1;&#x6587;&#x3002;&#x5982;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x7CFB;&#x7EDF;&#x8BED;&#x8A00;&#x8BBE;&#x7F6E;&#x5207;&#x6362;&#xFF0C;&#x4F8B;&#x5982;linux&#x4E0B;&#x8BBE;&#x7F6E;<code>LC_ALL</code>&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x4E3A;<code>en_US</code>&#x3002;</p>
<p><img src="assets/fig9.png" alt=""></p>
<ol>
<li>--input</li>
</ol>
<p>&#x7B80;&#x5199;&#x4E3A;&#x201C;-i&#x201D;&#x3002;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x8BE5;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x6570;&#x636E;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x4E24;&#x79CD;&#x6570;&#x636E;&#x683C;&#x5F0F;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x518D;&#x8D58;&#x8FF0;&#x3002;</p>
<ol>
<li>--output</li>
</ol>
<p>&#x7B80;&#x5199;&#x4E3A;&#x201C;-o&#x201D;&#x3002;&#x8BE5;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x81EA;&#x5B9A;&#x4E49;&#x7ED3;&#x679C;&#x7684;&#x8F93;&#x51FA;&#x8DEF;&#x5F84;&#xFF0C;&#x8DEF;&#x5F84;&#x4E0D;&#x5B58;&#x5728;&#x4F1A;&#x81EA;&#x52A8;&#x521B;&#x5EFA;&#x3002;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7ED3;&#x679C;&#x8F93;&#x51FA;&#x4F1A;&#x4E0E;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x5728;&#x76F8;&#x540C;&#x76EE;&#x5F55;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8BE5;&#x53C2;&#x6570;&#x6765;&#x81EA;&#x5B9A;&#x4E49;&#x3002;&#x4F8B;&#xFF1A;--output D:/data/</p>
<ol>
<li>--gpu-ids</li>
</ol>
<p>&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x8BE5;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x53C2;&#x4E0E;&#x8BA1;&#x7B97;&#x52A0;&#x901F;&#x7684;GPU&#x8BBE;&#x5907;&#x5E8F;&#x53F7;&#x3002;&#x53EF;&#x4EE5;&#x662F;&#x5355;&#x4E2A;&#x5E8F;&#x53F7;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x4EE5;&#x9017;&#x53F7;&#x5206;&#x9694;&#x7684;&#x591A;&#x4E2A;&#x5E8F;&#x53F7;&#xFF0C;&#x6CE8;&#x610F;&#x9017;&#x53F7;&#x4E3A;&#x82F1;&#x6587;&#x9017;&#x53F7;&#x4E14;&#x65E0;&#x7A7A;&#x683C;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E0D;&#x8BBE;&#x7F6E;&#xFF0C;&#x4F7F;&#x7528;CPU&#x3002;&#x4F8B;&#xFF1A;--gpu-ids 0,1,2&#x3002;</p>
<ol>
<li>--seed</li>
</ol>
<p>&#x8BE5;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x8F6F;&#x4EF6;&#x8BA1;&#x7B97;&#x4E2D;&#x968F;&#x673A;&#x8FC7;&#x7A0B;&#x7684;&#x968F;&#x673A;&#x6570;&#x79CD;&#x5B50;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;&#x4E0D;&#x8BBE;&#x7F6E;&#x3002;&#x4F8B;&#xFF1A;--seed 4067&#x3002;</p>
<ol>
<li>--k</li>
</ol>
<p>&#x8BE5;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x6A21;&#x578B;k&#x6298;&#x4EA4;&#x53C9;&#x8BAD;&#x7EC3;&#x7684;k&#x503C;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;5&#x3002;&#x4F8B;&#xFF1A;--k 4&#x3002;</p>
<ol>
<li>--adj-factor</li>
</ol>
<p>&#x8BE5;&#x53C2;&#x6570;&#x4E8C;&#x805A;&#x4F53;&#x8868;&#x8FBE;&#x6C34;&#x5E73;&#x7684;&#x8C03;&#x6574;&#x7CFB;&#x6570;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5047;&#x5B9A;&#x4E8C;&#x805A;&#x4F53;&#x7684;&#x8868;&#x8FBE;&#x6C34;&#x5E73;&#x662F;&#x5355;&#x4F53;&#x7684;&#x4E24;&#x500D;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x5B58;&#x5728;&#x6CE2;&#x52A8;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x6574;&#x8FD9;&#x4E2A;&#x7CFB;&#x6570;&#x6539;&#x53D8;&#x8868;&#x8FBE;&#x6C34;&#x5E73;&#x3002;&#x9ED8;&#x8BA4;&#x4E3A;1.0&#x3002;&#x4F8B;&#xFF1A;--adj-factor 0.8&#x3002;</p>
<ol>
<li>--dim</li>
</ol>
<p>&#x8BE5;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x6784;&#x5EFA;&#x7279;&#x5F81;&#x7684;&#x901A;&#x9053;&#x6570;&#xFF0C;&#x4E5F;&#x662F;&#x57FA;&#x56E0;&#x7279;&#x5F81;&#x964D;&#x7EF4;&#x7684;&#x76EE;&#x6807;&#x7EF4;&#x6570;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;10&#x3002;&#x4F8B;&#xFF1A;--dim 5&#x3002;</p>
<ol>
<li>--cube-id</li>
</ol>
<p>&#x8BE5;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x590D;&#x7528;&#x6B64;&#x524D;&#x4EA7;&#x751F;&#x7684;&#x7279;&#x5F81;&#x3002;&#x6240;&#x6709;&#x7279;&#x5F81;&#x4F1A;&#x4FDD;&#x5B58;&#x5728;embedding&#x5B50;&#x76EE;&#x5F55;&#x4E0B;&#x3002;&#x8BE5;&#x53C2;&#x6570;&#x5373;&#x4E3A;&#x8BE5;&#x5B50;&#x76EE;&#x5F55;&#x4E0B;&#x5177;&#x4F53;&#x7279;&#x5F81;&#x7684;ID&#xFF0C;&#x4E3A;&#x201C;XXXXXX-XXXXXX-XXX&#x201D;&#x6837;&#x5F0F;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x3002;&#x4F8B;&#xFF1A;--cube-id 20220704-120122-854.&#x3002;</p>
<ol>
<li>--learning-rate</li>
</ol>
<p>&#x7B80;&#x5199;&#x4E3A;&#x201C;-lr&#x201D;&#x3002;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x6DF1;&#x5EA6;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8BAD;&#x7EC3;&#x5B66;&#x4E60;&#x7387;&#x3002;&#x8BE5;&#x53C2;&#x6570;&#x5BF9;&#x68C0;&#x6D4B;&#x6548;&#x679C;&#x4F1A;&#x6709;&#x663E;&#x8457;&#x5F71;&#x54CD;&#x3002;&#x9ED8;&#x8BA4;&#x503C;&#x4E3A;1e-3&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x89C9;&#x5F97;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49;&#x3002;&#x4F8B;&#xFF1A;--learning-rate 1e-4&#x3002;</p>
<ol>
<li>--epochs</li>
</ol>
<p>&#x7B80;&#x5199;&#x4E3A;&#x201C;-e&#x201D;&#x3002;&#x8BE5;&#x53C2;&#x6570;&#x6307;&#x7684;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x7684;&#x6700;&#x5927;&#x8F6E;&#x6570;&#x3002;&#x4F46;&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x4F1A;&#x5728;&#x8FBE;&#x5230;&#x9ED8;&#x8BA4;&#x6700;&#x5927;&#x8F6E;&#x6570;100&#x524D;&#x5B8C;&#x6210;&#x8BAD;&#x7EC3;&#x3002;&#x4F8B;&#xFF1A;--epochs 50&#x3002;</p>
<ol>
<li>--train-batch-size</li>
</ol>
<p>&#x8BE5;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x7684;&#x6279;&#x6B21;&#x6570;&#x636E;&#x96C6;&#x5927;&#x5C0F;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;64&#x3002;&#x6279;&#x6B21;&#x6570;&#x636E;&#x96C6;&#x5927;&#x5C0F;&#x8F83;&#x5927;&#xFF0C;&#x8BAD;&#x7EC3;&#x6548;&#x679C;&#x5F80;&#x5F80;&#x8F83;&#x597D;&#xFF0C;&#x4F46;&#x5360;&#x7528;CPU&#x5185;&#x5B58;&#x6216;&#x8005;GPU&#x663E;&#x5B58;&#x8F83;&#x5927;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x8BBE;&#x5907;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x505A;&#x51FA;&#x8C03;&#x6574;&#x3002;&#x4F8B;&#xFF1A;--train-batch-size 32&#x3002;</p>
<ol>
<li>--valid-batch-size</li>
</ol>
<p>&#x4E0E;&#x524D;&#x7C7B;&#x4F3C;&#xFF0C;&#x8BE5;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x9A8C;&#x8BC1;&#x7684;&#x6279;&#x6B21;&#x6570;&#x636E;&#x96C6;&#x5927;&#x5C0F;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;512&#x3002;&#x56E0;&#x4E3A;&#x9A8C;&#x8BC1;&#x8FC7;&#x7A0B;&#x6BD4;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#x7684;&#x5185;&#x5B58;&#x6D88;&#x8017;&#x663E;&#x8457;&#x8F83;&#x5C0F;&#xFF0C;&#x56E0;&#x6B64;&#x9ED8;&#x8BA4;&#x503C;&#x8F83;&#x5927;&#x3002;&#x4F8B;&#xFF1A;--valid-batch-size 256&#x3002;</p>
<ol>
<li>--infer-batch-size</li>
</ol>
<p>&#x4E0E;&#x524D;&#x7C7B;&#x4F3C;&#xFF0C;&#x8BE5;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x9884;&#x6D4B;&#x7684;&#x6279;&#x6B21;&#x6570;&#x636E;&#x96C6;&#x5927;&#x5C0F;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;400&#x3002;&#x4F8B;&#xFF1A;--infer-batch-size 256&#x3002;</p>
<ol>
<li>--threshold</li>
</ol>
<p>&#x7B80;&#x5199;&#x201C;-t&#x201D;&#x3002;&#x8BE5;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x5206;&#x7C7B;&#x4E8C;&#x805A;&#x4F53;&#x4E0E;&#x5355;&#x4F53;&#x7684;&#x6982;&#x7387;&#x9608;&#x503C;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;0.5&#x3002;&#x6B63;&#x5982;&#x524D;&#x9762;CSV&#x7ED3;&#x679C;&#x6587;&#x4EF6;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x5927;&#x4E8E;&#x9608;&#x503C;&#x7684;&#x7EC6;&#x80DE;&#x6837;&#x672C;&#x4F1A;&#x88AB;&#x5224;&#x5B9A;&#x4E3A;&#x4E8C;&#x805A;&#x4F53;&#x3002;&#x4F8B;&#xFF1A;-t 0.5&#x3002;</p>
<ol>
<li>--enable-validation</li>
</ol>
<p>&#x7B80;&#x5199;&#x201C;-ev&#x201D;&#x3002;&#x8BE5;&#x53C2;&#x6570;&#x662F;&#x4F4D;&#x7F6E;&#x53C2;&#x6570;&#xFF0C;&#x65E0;&#x540E;&#x7EED;&#x503C;&#x3002;&#x4F7F;&#x7528;&#x5B83;&#x8868;&#x793A;&#x542F;&#x7528;&#x7ED3;&#x679C;&#x9A8C;&#x8BC1;&#xFF0C;&#x8BE5;&#x529F;&#x80FD;&#x4EC5;&#x7528;&#x4E8E;&#x590D;&#x73B0;&#x7ED3;&#x679C;&#x7684;&#x8BC4;&#x4F30;&#x6307;&#x6807;&#x3002;&#x4F7F;&#x7528;&#x65F6;&#x8981;&#x6C42;&#x6570;&#x636E;&#x8F93;&#x5165;&#x683C;&#x5F0F;&#x4E3A;H5AD&#x683C;&#x5F0F;&#xFF0C;&#x4E14;&#x5728;&#x5176;AnnData&#x5BF9;&#x8C61;&#x7684;&#x201C;obs&#x201D;&#x5C5E;&#x6027;&#x4E2D;&#x6709;&#x201C;type&#x201D;&#x5217;&#xFF0C;&#x5185;&#x5BB9;&#x4E3A;&#x201C;doublet&#x201D;&#x6216;&#x201C;singlet&#x201D;&#xFF0C;&#x8868;&#x793A;&#x8BE5;&#x6570;&#x636E;&#x96C6;&#x7684;&#x771F;&#x5B9E;&#x6807;&#x6CE8;&#x3002;</p>
<ol>
<li>--enable-multiprocess</li>
</ol>
<p>&#x7B80;&#x5199;&#x201C;-mp&#x201D;&#x3002;&#x8BE5;&#x53C2;&#x6570;&#x662F;&#x4F4D;&#x7F6E;&#x53C2;&#x6570;&#xFF0C;&#x65E0;&#x540E;&#x7EED;&#x503C;&#x3002;&#x4F7F;&#x7528;&#x5B83;&#x8868;&#x793A;&#x542F;&#x7528;&#x591A;&#x8FDB;&#x7A0B;&#x8BAD;&#x7EC3;&#x3002;&#x6B64;&#x65F6;SoCube&#x4F1A;&#x521B;&#x5EFA;k&#x4E2A;&#x5B50;&#x8FDB;&#x7A0B;&#x6765;&#x5E76;&#x884C;&#x8BAD;&#x7EC3;k&#x4E2A;&#x5B50;&#x6A21;&#x578B;&#xFF08;k&#x503C;&#x7531;&#x2014;k&#x53C2;&#x6570;&#x6307;&#x5B9A;&#xFF09;&#x3002;&#x591A;&#x8FDB;&#x7A0B;&#x8BAD;&#x7EC3;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x68C0;&#x6D4B;&#x901F;&#x5EA6;&#xFF0C;&#x4F46;&#x662F;&#x5C5E;&#x4E8E;&#x7A7A;&#x95F4;&#x6362;&#x65F6;&#x95F4;&#xFF0C;&#x4F1A;&#x589E;&#x5927;&#x5185;&#x5B58;&#x548C;&#x663E;&#x5B58;&#x5F00;&#x9500;&#xFF0C;&#x56E0;&#x6B64;&#x7528;&#x6237;&#x9700;&#x8981;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x96C6;&#x5927;&#x5C0F;&#x4E0E;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x5224;&#x65AD;&#x662F;&#x5426;&#x5F00;&#x542F;&#x591A;&#x8FDB;&#x7A0B;&#x3002;&#x5F53;&#x7136;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x8C03;&#x8282;&#x524D;&#x9762;&#x7684;&#x6279;&#x6B21;&#x53C2;&#x6570;&#x6765;&#x964D;&#x4F4E;&#x5185;&#x5B58;&#x5360;&#x7528;&#x3002;</p>
<ol>
<li>--mail</li>
</ol>
<p>&#x8BE5;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x4E86;&#x7528;&#x4E8E;&#x7ED3;&#x679C;&#x901A;&#x77E5;&#x7684;&#x90AE;&#x7BB1;&#x5730;&#x5740;&#xFF0C;&#x4EFB;&#x4F55;&#x652F;&#x6301;SMTP&#x534F;&#x8BAE;&#x7684;&#x90AE;&#x4EF6;&#x4F9B;&#x5E94;&#x5546;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF0C;&#x4F8B;&#x5982;QQ&#x90AE;&#x7BB1;&#x3001;Gmail&#x7B49;&#x3002;&#x9700;&#x8981;&#x548C;&#x540E;&#x7EED;&#x51E0;&#x4E2A;&#x90AE;&#x7BB1;&#x53C2;&#x6570;&#x914D;&#x5408;&#x4F7F;&#x7528;&#x3002;</p>
<ol>
<li>--mail-server</li>
</ol>
<p>&#x8BE5;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x4E86;&#x90AE;&#x4EF6;&#x4F9B;&#x5E94;&#x5546;&#x7684;SMTP&#x670D;&#x52A1;&#x5668;&#x57DF;&#x540D;&#x3002;&#x5177;&#x4F53;&#x8BF7;&#x54A8;&#x8BE2;&#x60A8;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x90AE;&#x7BB1;&#x4F9B;&#x5E94;&#x5546;&#x3002;&#x4F8B;&#xFF1A;--mail-server smtp.gmail.com&#x3002;</p>
<ol>
<li>--mail-port</li>
</ol>
<p>&#x8BE5;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x4E86;&#x90AE;&#x4EF6;&#x4F9B;&#x5E94;&#x5546;&#x7684;SMTP&#x670D;&#x52A1;&#x7AEF;&#x53E3;&#x3002;&#x5177;&#x4F53;&#x8BF7;&#x54A8;&#x8BE2;&#x60A8;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x90AE;&#x4EF6;&#x4F9B;&#x5E94;&#x5546;&#x3002;&#x4F8B;&#xFF1A;--mail-port 994&#x3002;</p>
<ol>
<li>--mail-passwd</li>
</ol>
<p>&#x8BE5;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x4E86;&#x90AE;&#x7BB1;&#x7684;&#x5BC6;&#x7801;&#x3002;&#x4E00;&#x822C;&#x5C31;&#x662F;&#x7F51;&#x9875;&#x90AE;&#x7BB1;&#x7684;&#x767B;&#x5F55;&#x5BC6;&#x7801;&#xFF0C;&#x4F46;&#x90AE;&#x4EF6;&#x4F9B;&#x5E94;&#x5546;&#x53E6;&#x6709;&#x7EA6;&#x5B9A;&#x7684;&#x9664;&#x5916;&#xFF0C;&#x5177;&#x4F53;&#x8BF7;&#x54A8;&#x8BE2;&#x60A8;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x90AE;&#x4EF6;&#x4F9B;&#x5E94;&#x5546;&#x3002;</p>
<ol>
<li>--enable-ssl</li>
</ol>
<p>&#x542F;&#x7528;&#x8BE5;&#x53C2;&#x6570;&#x4EE3;&#x8868;&#x90AE;&#x4EF6;&#x670D;&#x52A1;&#x4F7F;&#x7528;SSL&#x52A0;&#x5BC6;&#x3002;</p>

<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="5-problem-solution.html" class="navigation navigation-prev " aria-label="Previous page: 问题解决">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="term.html" class="navigation navigation-next " aria-label="Next page: 术语">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"参数详解","level":"1.6","depth":1,"next":{"title":"术语","level":"1.7","depth":1,"path":"term.md","ref":"term.md","articles":[]},"previous":{"title":"问题解决","level":"1.5","depth":1,"path":"5-problem-solution.md","ref":"5-problem-solution.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-livereload","tabs2","popup","code","github","splitter","sharing","prism","image-captions-extended","search-plus","-highlight","-search","-lunr"],"styles":{"website":"styles/website.css"},"pluginsConfig":{"prism":{},"github":{"url":"https://github.com/GCS-ZHN/socube"},"splitter":{},"image-captions-extended":{},"popup":{},"code":{"copyButtons":true},"fontsettings":{"theme":"white","family":"sans","size":2},"tabs2":{},"sharing":{"all":["facebook","google","twitter","weibo","instapaper"],"facebook":true,"google":false,"instapaper":false,"twitter":true,"vk":false,"weibo":false},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"search-plus":{},"image-captions":{"caption":"_CAPTION_","variable_name":"_pictures"}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"_pictures":[{"backlink":"index.html#fig1.1.1","level":"1.1","list_caption":"Figure: SoCube工作流程示意","alt":"SoCube工作流程示意","nro":1,"url":"assets/workflow.svg","index":1,"caption_template":"_CAPTION_","label":"SoCube工作流程示意","attributes":{},"skip":false,"key":"1.1.1"},{"backlink":"3-install.html#fig1.3.1","level":"1.3","list_caption":"Figure: Nvidia cuda下载页面","alt":"Nvidia cuda下载页面","nro":2,"url":"assets/fig7.png","index":1,"caption_template":"_CAPTION_","label":"Nvidia cuda下载页面","attributes":{},"skip":false,"key":"1.3.1"},{"backlink":"3-install.html#fig1.3.2","level":"1.3","list_caption":"Figure: nvidia-smi","alt":"nvidia-smi","nro":3,"url":"assets/fig8.png","index":2,"caption_template":"_CAPTION_","label":"nvidia-smi","attributes":{},"skip":false,"key":"1.3.2"},{"backlink":"3-install.html#fig1.3.3","level":"1.3","list_caption":"Figure: Python官网","alt":"Python官网","nro":4,"url":"assets/fig1.png","index":3,"caption_template":"_CAPTION_","label":"Python官网","attributes":{},"skip":false,"key":"1.3.3"},{"backlink":"3-install.html#fig1.3.4","level":"1.3","list_caption":"Figure: Python安装页面","alt":"Python安装页面","nro":5,"url":"assets/fig2.png","index":4,"caption_template":"_CAPTION_","label":"Python安装页面","attributes":{},"skip":false,"key":"1.3.4"},{"backlink":"3-install.html#fig1.3.5","level":"1.3","list_caption":"Figure: 运行powershell","alt":"运行powershell","nro":6,"url":"assets/fig3.png","index":5,"caption_template":"_CAPTION_","label":"运行powershell","attributes":{},"skip":false,"key":"1.3.5"},{"backlink":"4-usage.html#fig1.4.1","level":"1.4","list_caption":"Figure: 启动socube","alt":"启动socube","nro":7,"url":"assets/fig5.png","index":1,"caption_template":"_CAPTION_","label":"启动socube","attributes":{},"skip":false,"key":"1.4.1"},{"backlink":"4-usage.html#fig1.4.2","level":"1.4","list_caption":"Figure: final\\_result的的CSV文件文件","alt":"final\\_result的的CSV文件文件","nro":8,"url":"assets/fig6.png","index":2,"caption_template":"_CAPTION_","label":"final\\_result的的CSV文件文件","attributes":{},"skip":false,"key":"1.4.2"},{"backlink":"4-usage.html#fig1.4.3","level":"1.4","list_caption":"Figure: 可用镜像","alt":"可用镜像","nro":9,"url":"assets/fig11.png","index":3,"caption_template":"_CAPTION_","label":"可用镜像","attributes":{},"skip":false,"key":"1.4.3"}]},"title":"SoCube user manual","language":"zh-hans","gitbook":"*"},"file":{"path":"6-parameters.md","mtime":"2022-07-18T13:40:09.547Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-07-18T13:41:04.231Z"},"basePath":".","book":{"language":"zh-hans"}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-tabs2/tabs.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-plus/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

